pajacobs-ghub/pic18f26q71-comms-4-mcu/comms-4-mcu.c
// comms-4-mcu.c
// RS485 communications MCU using the PIC18F26Q71.
// A Pico2 is the DAQ-MCU.
//
// Peter J.
// 2025-10-07 First cut is to adapt the COMMS-2 firmware from the PIC18f16Q41
// 2025-10-04 Edit PCB tracks so that we can use negative-channel inputs to 
//            comparators 1 and 2 for the internal and external trigger signals.
// 2025-11-09 Clean up the functions and put them to use.
// 2025-11-11 Simple hardware trigger function, as used for PIC18F16Q41-COMMS-1.
// 2025-11-14 Utility pins are available for analog and digital functions.
// 2026-03-02 Adapt from the PIC18F26Q71-COMMS-3 firmware and add the SPI-clock
//            buffering from the PIC18F16Q41-COMMS-2 firmware
// 2026-03-10 I2C communication, for interaction with AFE boards.
// 2026-03-11 SPI communication, for interaction with AFE boards.
//
// CONFIG1
#pragma config FEXTOSC = OFF
#pragma config RSTOSC = HFINTOSC_64MHZ

// CONFIG2
#pragma config CLKOUTEN = OFF
#pragma config PR1WAY = OFF
#pragma config BBEN = OFF
#pragma config CSWEN = OFF
#pragma config FCMEN = OFF
#pragma config FCMENP = OFF
#pragma config FCMENS = OFF

// CONFIG3
#pragma config MCLRE = EXTMCLR
#pragma config PWRTS = PWRT_64
#pragma config MVECEN = OFF
#pragma config IVT1WAY = OFF
#pragma config LPBOREN = OFF
#pragma config BOREN = SBORDIS

// CONFIG4
#pragma config BORV = VBOR_1P9
#pragma config ZCD = OFF
#pragma config PPS1WAY = OFF
#pragma config STVREN = ON
#pragma config LVP = ON
#pragma config DEBUG = OFF
#pragma config XINST = OFF

// CONFIG5
#pragma config WDTCPS = WDTCPS_31
#pragma config WDTE = ON

// CONFIG6
#pragma config WDTCWS = WDTCWS_7
#pragma config WDTCCS = SC

// CONFIG7
// BBSIZE = No Setting

// CONFIG8
#pragma config SAFSZ = SAFSZ_NONE

// CONFIG9
#pragma config WRTB = OFF
#pragma config WRTC = OFF
#pragma config WRTD = OFF
#pragma config WRTSAF = OFF
#pragma config WRTAPP = OFF

// CONFIG10
#pragma config CPD = OFF

// CONFIG11
#pragma config CP = OFF

#include <xc.h>
#include "global_defs.h"
#include <stdint.h>
#include <stdlib.h>

#include "uart.h"
#include "i2c.h"
#include "spi.h"
#include <stdio.h>
#include <string.h>

#define VERSION_STR "v0.4 PIC18F26Q71 COMMS-4-MCU 2026-03-11"

// Each device on the RS485 network has a unique single-character identity.
// The master (PC) has identity '0'. Slave nodes may be 1-9A-Za-z.
// When programming each device, select a suitable value for MYID.
#define MYID 'F'

// The following definitions are for sensing.
#define PICO2_READY_PIN (PORTBbits.RB4)
#define EVENTn_PIN (PORTBbits.RB3)

// The following definition is for output.
#define PICO2_RESETn_PIN (LATBbits.LATB5)

void init_pins()
{
    // RB4 as digital-input for DAQ-MCU Ready/Busy# signal.
    TRISBbits.TRISB4 = 1;
    ANSELBbits.ANSELB4 = 0;
    //
    // RB5 as digital-output for restart of Pico2 DAQ_MCU,
    // open-drain, weak pull-up is not needed.
    ODCONBbits.ODCB5 = 1;
    // WPUBbits.WPUB5 = 1;
    PICO2_RESETn_PIN = 1;
    TRISBbits.TRISB5 = 0;
    ANSELBbits.ANSELB5 = 0;
    //
    // Initially, we will be sensing the EVENTn line,
    // to see if other devices have pulled the line low
    // to indicate the event.
    // Later it may be driven low by software command or
    // it may be driven by hardware (comparator latched by CLC3).
    ANSELBbits.ANSELB3 = 0;
    TRISBbits.TRISB3 = 1; // input EVENTn line
    // The following lines are compatible with the un-asserted state,
    // for when the pin is driven by this device.
    ODCONBbits.ODCB3 = 1;
    LATBbits.LATB3 = 1;
    //
    // Use RA3(out),RA2(in) to buffer SPICLK from Pico2
    //
    ANSELAbits.ANSELA2 = 0;
    TRISAbits.TRISA2 = 1; // input from Pico2
    ANSELAbits.ANSELA3 = 0;
    LATAbits.LATA3 = 0;
    TRISAbits.TRISA3 = 0; // output to MCP3301
    // Use CLC2 to reflect RA2 onto RA3.
    // Follow the set-up description in Section 22.6 of datasheet.
    CLCSELECT = 0b01; // To select CLC2 registers for the following settings.
    CLCnCONbits.EN = 0; // Disable while setting up.
    // Data select from outside world
    CLCnSEL0 = 0; // data1 gets CLCIN0PPS as input
    CLCnSEL1 = 0; // data2 gets CLCIN0PPS as input, also
    CLCnSEL2 = 0; // data3 gets CLCIN0PPS as input, but gets ignored in logic select
    CLCnSEL3 = 0; // data4 as for data3
    // Logic select into gates
    CLCnGLS0 = 0b0010; // data1 goes through true to gate 1
    CLCnGLS1 = 0b1000; // data2 goes through true to gate 2
    CLCnGLS2 = 0; // gate 3 gets logic 0
    CLCnGLS3 = 0; // gate 4 gets logic 0
    // Gate output polarities
    CLCnPOLbits.G1POL = 0;
    CLCnPOLbits.G2POL = 0;
    CLCnPOLbits.G3POL = 0;
    CLCnPOLbits.G4POL = 0;
    // Logic function is AND-OR
    CLCnCONbits.MODE = 0b000;
    CLCnPOLbits.POL = 0;
    // Connect CLC2 to the RA5,RA4 pins.
    GIE = 0;
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 0;
    CLCIN0PPS = 0b000010; // RA2
    RA3PPS = 0x02; // CLC2OUT
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 1;
    // Now that the connections are made and function selected, enable it.
    CLCnCONbits.EN = 1;
    //
    // Analog pins
    // External trigger signal is at RA0.
    TRISAbits.TRISA0 = 1;
    ANSELAbits.ANSELA0 = 1;
    // V_REF_A input pin ANA1/RA1.
    TRISAbits.TRISA1 = 1;
    ANSELAbits.ANSELA1 = 1;
    // V_REF_B is also of interest on RB1
    TRISBbits.TRISB1 = 1;
    ANSELBbits.ANSELB1 = 1;
    return;
}

static inline void assert_event_pin()
{
    // Actively pull the event pin low.
    LATBbits.LATB3 = 0;
    ODCONBbits.ODCB3 = 1;
    TRISBbits.TRISB3 = 0; // output EVENTn line
}

static inline void release_event_pin()
{
    // Release the drive on the pin and allow it to be pulled high.
    LATBbits.LATB3 = 1;
    TRISBbits.TRISB3 = 1; // input EVENTn line
}

void FVR_init()
{
    // We want to supply both the ADC and the DAC with the same reference
    // voltage that suits a 5V system.
    FVRCONbits.ADFVR = 3;  // 4v096
    FVRCONbits.CDAFVR = 3; // 4v096
    FVRCONbits.EN = 1;
    while (!FVRCONbits.RDY) { /* should be less than 25 microseconds */ }
    return;
}

