pajacobs-ghub/pic18f26q71-comms-4-mcu/comms-4-mcu.c
void FVR_close()
{
    FVRCONbits.EN = 0;
    FVRCONbits.ADFVR = 0;
    FVRCONbits.CDAFVR = 0;
    return;
}

#define ADC_RA0 0x00
#define ADC_RA1 0x01
#define ADC_RB1 0x09

void ADC_init()
{
    // Set up the ADC to look at one of the analog pins. 
    //
    ADCON0bits.CS = 1; // use dedicated RC oscillator
    ADCON0bits.IC = 0; // single-ended input
    ADCON0bits.FM = 1; // right-justified result
    ADCON2bits.MD = 0b011; // burst-average mode
    PIR1bits.ADIF = 0;
    ADREFbits.NREF = 0; // negative reference is Vss
    ADREFbits.PREF = 0b11; // positive reference is FVR
    ADACQ = 0x10; // 16TAD acquisition period
    ADNCH = 0b1110111; // select VSS
    ADPCH = ADC_RA0;
    ADCON0bits.ON = 1; // power on the device
    return;
}

void ADC_select(uint8_t byte_value)
{
    ADPCH = byte_value;
    return;
}

uint16_t ADC_read()
{
    // Returns the value from the ADC when looking at the input pin
    // for the comparator.
    ADCON0bits.GO = 1;
    NOP();
    while (ADCON0bits.GO) { /* wait, should be brief */ }
    PIR1bits.ADIF = 0;
    return ADRES;
}

void ADC_close()
{
    ADCON0bits.ON = 0;
    return;
}

void set_VREF_AB(uint8_t levelA, uint8_t levelB)
{
    // Assuming that the fixed voltage reference is on at 4v096,
    // take a fraction of that reference voltage and feed it through the
    // 8-bit DAC2 and then through the OPA1 to the external pin (OPA1OUT/RA1)
    // to get VREF_A.
    //
    DAC2CONbits.PSS = 0b10; // FVR Buffer 2
    DAC2CONbits.NSS = 0; // VSS
    DAC2CONbits.EN = 1;
    DAC2DATL = levelA;
    //
    OPA1CON0bits.UG = 1; // unity gain
    OPA1CON0bits.CPON = 1; // charge-pump is on, high power mode
    OPA1CON2bits.PCH = 0b101; // DAC2_OUT
    OPA1CON0bits.EN = 1;
    //
    // Take a fraction of the same fixed voltage reference and feed it
    // through the 8-bit DAC3 buffered by OPA2 then to the external pin 
    // (OPA2OUT/RB1) to get VREF_B
    //
    DAC3CONbits.PSS = 0b10; // FVR Buffer 2
    DAC3CONbits.NSS = 0; // VSS
    DAC3CONbits.EN = 1;
    DAC3DATL = levelB;
    //
    OPA2CON0bits.UG = 1; // unity gain
    OPA2CON0bits.CPON = 1; // charge-pump is on, high power mode
    OPA2CON2bits.PCH = 0b110; // DAC3_OUT
    OPA2CON0bits.EN = 1;
    //
    __delay_ms(1);
}

void disable_VREF_AB()
{
    OPA1CON0bits.EN = 0;
    DAC2CONbits.EN = 0;
    OPA2CON0bits.EN = 0;
    DAC3CONbits.EN = 0;
}

uint8_t enable_external_trigger(uint16_t level, int8_t slope)
{
    // The external trigger signal is connected to C1IN0-/RA0.
    // It uses comparator 1 to sense the analog signal,
    // 10-bit DAC1 as the reference, and CLC1 as the SR latch.
    //
    // Input:
    // level sets the trigger voltage
    // slope=1 to trigger on exceeding level
    // slope=0 to trigger on going below level
    //
    // Returns:
    // 0 if successfully set up,
    // 1 if the comparator is already high.
    //
    // Use DAC2 for the reference level.
    DAC1CONbits.PSS = 0b10; // FVR Buffer 2
    DAC1CONbits.NSS = 0; // VSS
    DAC1CONbits.EN = 1;
    DAC1DATH = (uint8_t)(level >> 8);
    DAC1DATL = (uint8_t)level;
    __delay_ms(1);
    //
    // Our external signal goes into the inverting input of the comparator
    // and we use the DAC2 output as the reference on the noninverting input.
    CM1NCH = 0b000; // C1IN0- pin
    CM1PCH = 0b011; // DAC1_Output
    if (slope) {
        // Invert comparator output-polarity to get trigger on positive slope.
        CM1CON0bits.POL = 1;
    } else {
        CM1CON0bits.POL = 0;
    }
    CM1CON0bits.HYS = 0; // no hysteresis
    CM1CON0bits.SYNC = 0; // async output
    CM1CON0bits.EN = 1;
    // The signal out of the comparator should transition 0 to 1
    // as the external trigger voltage crosses the specified level.
    __delay_ms(1);
    if (CMOUTbits.MC1OUT) {
        // Fail early because the comparator is already triggered.
        return 1;
    }
    // Use CLC3 to latch the comparator output to RB3.
    //
    // Follow the set-up description in Section 22.6 of datasheet.
    CLCSELECT = 0b010; // To select CLC3 registers for the following settings.
    CLCnCONbits.EN = 0; // Disable while setting up.
    // Data select from outside world
    CLCnSEL0 = 0x20; // data1 gets CMP1_OUT as input
    CLCnSEL1 = 0; // data2 gets CLCIN0PPS as input, but gets ignored in logic select
    CLCnSEL2 = 0; // data3 as for data2
    CLCnSEL3 = 0; // data4 as for data2
    // Logic select into gates
    CLCnGLS0 = 0b10; // data1 goes through true to gate 1 (S-R set)
    CLCnGLS1 = 0; // gate 2 gets logic 0 (S-R set)
    CLCnGLS2 = 0; // gate 3 gets logic 0 (S-R reset)
    CLCnGLS3 = 0; // gate 4 gets logic 0 (S-R reset)
    // Gate output polarities
    CLCnPOLbits.G1POL = 0;
    CLCnPOLbits.G2POL = 0;
    CLCnPOLbits.G3POL = 0;
    CLCnPOLbits.G4POL = 0;
    // Logic function is S-R latch
    CLCnCONbits.MODE = 0b011;
    CLCnPOLbits.POL = 1; // Invert output; EVENT# is active low.
    // Now that the S-R latch is set up, enable it.
    CLCnCONbits.EN = 1;
    // Connect CLC1OUT to the RB3 pin.
    ODCONBbits.ODCB3 = 1;
    TRISBbits.TRISB3 = 0; // output
    GIE = 0;
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 0;
    RB3PPS = 0x03; // CLC3OUT to EVENTn_PIN
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 1;
    return 0; // Success is presumed.
}

void disable_hardware_trigger()
{
    // Disables external trigger.
    TRISBbits.TRISB3 = 1; // input, if we are not wanting to drive it.
    CLCSELECT = 0b010; // To select CLC3 for the following setting.
    CLCnCONbits.EN = 0;
    CM1CON0bits.EN = 0;
    CM2CON0bits.EN = 0;
    DAC1CONbits.EN = 0;
    // Reconnect LATB to the RB3 pin,
    // so we may drive EVENTn via software.
    GIE = 0;
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 0;
    RB3PPS = 0x00; // LATB3 to EVENTn_PIN
    PPSLOCK = 0x55;
    PPSLOCK = 0xaa;
    PPSLOCKED = 1;
    return;
}

uint8_t read_utility_pins()
{
    // Although the pins happen to be grouped together in the current design,
    // we'll set the bits one at a time, in case we ever reassign them.
    uint8_t bits = 0;
    if (PORTAbits.RA7) bits |= 0b1000;
    if (PORTAbits.RA6) bits |= 0b0100;
    if (PORTAbits.RA5) bits |= 0b0010;
    if (PORTAbits.RA4) bits |= 0b0001;
    return bits;
}

void write_utility_pins(char action, uint8_t bits)
{
    // Although the pins happen to be grouped together in the current design,
    // we'll set the bits one at a time, in case we ever reassign them.
    switch (action) {
    case 'A':
    case 'a':
        ANSELAbits.ANSELA7 = (bits & 0b1000) ? 1 : 0;
        ANSELAbits.ANSELA6 = (bits & 0b0100) ? 1 : 0;
        ANSELAbits.ANSELA5 = (bits & 0b0010) ? 1 : 0;
        ANSELAbits.ANSELA4 = bits & 0b0001;
        break;
    case 'T':
    case 't':
        TRISAbits.TRISA7 = (bits & 0b1000) ? 1 : 0;
        TRISAbits.TRISA6 = (bits & 0b0100) ? 1 : 0;
        TRISAbits.TRISA5 = (bits & 0b0010) ? 1 : 0;
        TRISAbits.TRISA4 = bits & 0b0001;
        break;
    case 'O':
    case 'o':
        ODCONAbits.ODCA7 = (bits & 0b1000) ? 1 : 0;
        ODCONAbits.ODCA6 = (bits & 0b0100) ? 1 : 0;
        ODCONAbits.ODCA5 = (bits & 0b0010) ? 1 : 0;
        ODCONAbits.ODCA4 = bits & 0b0001;
        break;
    case 'W':
    case 'w':
        WPUAbits.WPUA7 = (bits & 0b1000) ? 1 : 0;
        WPUAbits.WPUA6 = (bits & 0b0100) ? 1 : 0;
        WPUAbits.WPUA5 = (bits & 0b0010) ? 1 : 0;
        WPUAbits.WPUA4 = bits & 0b0001;
        break;
    case 'L':
    case 'l':
        LATAbits.LATA7 = (bits & 0b1000) ? 1 : 0;
        LATAbits.LATA6 = (bits & 0b0100) ? 1 : 0;
        LATAbits.LATA5 = (bits & 0b0010) ? 1 : 0;
        LATAbits.LATA4 = bits & 0b0001;
        break;
    default:
        /* do nothing */ ;
    }
    return;
}

// For incoming RS485 comms
#define NBUFA 80
char bufA[NBUFA];
// For outgoing RS485 comms
#define NBUFB 268
char bufB[NBUFB];
// For incoming DAQ-MCU responses
#define NBUFC 256
char bufC[NBUFC];
// For I2C and SPI communication with AFE boards
#define NBUF_I2C 32
uint8_t buf_I2C[NBUF_I2C];
#define NBUF_DIGITS 8
char buf_digits[NBUF_DIGITS];

int find_char(char* buf, int start, int end, char c)
// Returns the index of the character if found, -1 otherwise.
// start is the index of the first character to check.
// end is the index of the last character to check.
{
    for (int i = start; i <= end; i++) {
        if (buf[i] == '\0') return -1;
        if (buf[i] == c) return i;
    }
    return -1;
}

char* trim_RS485_command(char* buf, int nbytes)
// Returns a pointer to the command text string, within buf.
// The resulting string may be zero-length.
//
// A valid incoming command from the RS485 will be of the form
// "/cXXXXXXXX!"
// where the components are
//    / is the start character
//    ! is the end character
//    c is the MYID character, identifying the receiving node
//    XXXXXXX is the command text
//
// This format is described in the text:
// J.M. Hughes
// Real World Instrumentation
// O'Rielly 2010
// Chapter 11 Instrumentation Data I/O, Unique Protocols.
//
{
    // printf("DEBUG: buf=%s", buf);
    int start = find_char(buf, 0, nbytes-1, '/');
    if (start == -1) {
        // Did not find starting '/'
        buf[0] = '\0'; // make it a zero-length string
        return &buf[0];
    }
    int end = find_char(buf, start, nbytes-1, '!');
    if (end == -1) {
        // Did not find terminating '!'
        buf[0] = '\0'; // make it a zero-length string
        return &buf[0];
    }
    // At this point, we have a valid incoming command.
    if (buf[start+1] != MYID) {
        // The incoming message is not for this node, so discard it.
        buf[0] = '\0'; // make it a zero-length string
        return &buf[0];
    }
    // At this point, the message is for us.
    buf[end] = '\0'; // Trim off the '!' character.
    // On return, omit the MYID character from the front.
    return &buf[start+2];
} // end trim_command()

