pajacobs-ghub/pic18f26q71-comms-4-mcu/comms-4-mcu.c
void interpret_RS485_command(char* cmdStr)
// We intend that valid commands are answered quickly
// so that the supervisory PC can infer the absence of a node
// by the lack of a prompt response.
// A command that does not do what is expected should return a message
// that includes the word "error".
{
    char* token_ptr;
    const char* sep_tok = ", ";
    int nchar;
    uint8_t i, j;
    // nchar = printf("DEBUG: cmdStr=%s", cmdStr);
    switch (cmdStr[0]) {
        case 'v':
            nchar = snprintf(bufB, NBUFB, "/0v %s#\n", VERSION_STR);
            uart1_putstr(bufB);
            break;
        case 't':
            // Software trigger to assert EVENTn line low.
            disable_hardware_trigger(); // Can enable only one at a time.
            assert_event_pin();
            nchar = snprintf(bufB, NBUFB, "/0t Software trigger#\n");
            uart1_putstr(bufB);
            break;
        case 'z':
            // Release EVENTn line (from software trigger).
            release_event_pin();
            nchar = snprintf(bufB, NBUFB, "/0z Release EVENTn line#\n");
            uart1_putstr(bufB);
            break;
        case 'Q':
            // Query the status signals.
            // READY/BUSYn is from the AVR.
            // EVENTn is a party line that anyone may pull low.
            nchar = snprintf(bufB, NBUFB, "/0Q %d %d#\n", EVENTn_PIN, PICO2_READY_PIN);
            uart1_putstr(bufB);
            break;
        case 'F':
            // Flush the RX2 buffer for incoming text from the DAQ MCU.
            uart2_flush_rx();
            nchar = snprintf(bufB, NBUFB, "/0F Flushed RX2 buffer#\n");
            uart1_putstr(bufB);
            break;
        case 'R':
            // Restart the attached DAQ MCU.
            PICO2_RESETn_PIN = 0;
            __delay_ms(1);
            PICO2_RESETn_PIN = 1;
            // Wait until we are reasonably sure that the DAQ MCU has restarted
            // and then flush the incoming serial buffer.
            __delay_ms(350);
            uart2_flush_rx();
            nchar = snprintf(bufB, NBUFB, "/0R DAQ_MCU restarted#\n");
            uart1_putstr(bufB);
            break;
        case 'a':
            // Report the ADC value for the analog signal on the selected pin.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume that it is an integer
                // that specifies which pin to sample.
                // 0x00  ANA0 (external trigger)
                // 0x01  OPA1OUT/ANA1 (V_REF_A)
                // 0x09  OPA2OUT/ANB1 (V_REF_B)
                uint8_t pin = (uint8_t)atoi(token_ptr);
                ADC_select(pin);
                uint16_t aValue = ADC_read();
                nchar = snprintf(bufB, NBUFB, "/0a %u#\n", aValue);
            } else {
                nchar = snprintf(bufB, NBUFB, "/0a error: no pin specified#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'e':
            // Enable external trigger, to pull EVENTn line low on the
            // external trigger signal.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume trigger level
                // and, maybe, slope flag.  Default slope flag is 1
                // (for trigger on a positive slope).
                int16_t level = atoi(token_ptr);
                if (level > 1023) level = 1023;
                if (level < 0) level = 0;
                int8_t slope = 1;
                token_ptr = strtok(NULL, sep_tok);
                if (token_ptr) {
                    slope = (int8_t) atoi(token_ptr);
                }
                uint8_t flag = enable_external_trigger((uint16_t)level, slope);
                if (flag) {
                    nchar = snprintf(bufB, NBUFB, "/0e error: comparator already triggered#\n");
                } else {
                    nchar = snprintf(bufB, NBUFB, "/0e %d %d#\n", level, slope);
                }
            } else {
                // There was no text to give a trigger level.
                nchar = snprintf(bufB, NBUFB, "/0e error: no level supplied#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'd':
            // Disable trigger and release the EVENTn line.
            disable_hardware_trigger();
            release_event_pin();
            nchar = snprintf(bufB, NBUFB, "/0d Disable hardware trigger#\n");
            uart1_putstr(bufB);
            break;
            break;
        case 'u':
            // Interact with the 'utility' pins RA7, RA6, RA5 and RA4
            // as general-purpose I/O pins.
            //
            // The form of the command is
            // 'u' <action> <bits>
            // <action> is one of
            //   'P' read PORT bits (for input; <bits> is not required)
            //   'T' set TRIS bits (output-drive control 1=input 0=output)
            //   'O' set ODC bits (open-drain control)
            //   'W' set WPU bits (weak pull-up)
            //   'L' set LAT bits (latch for output)
            //   'A' set ANSEL bits (1=analog, 0=digital input buffer)
            // <bits> are mapped to relevant pins as
            //   bit     7    6    5    4    3    2    1    0
            //   pin     X    X    X    X  RA7  RA6  RA5  RA4
            //
            // Note that the relevant register for each pin will be written
            // with new data for each call with a write action.
            // If you want to leave some pins unchanged from their current state,
            // you will need to send appropriate data.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume is is a single character
                // that specifies the action, as described above.
                char action = (char) *token_ptr;
                if (action == 'P' || action == 'p') {
                    uint8_t bits = read_utility_pins();
                    nchar = snprintf(bufB, NBUFB, "/0u %c 0x%02x#\n", action, bits);
                } else {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        uint8_t bits = (uint8_t) atoi(token_ptr);
                        write_utility_pins(action, bits);
                        nchar = snprintf(bufB, NBUFB, "/0u %c 0x%02x#\n", action, bits);
                    } else {
                        nchar = snprintf(bufB, NBUFB, "/0u error: no bits specified#\n");
                    }
                }
            } else {
                nchar = snprintf(bufB, NBUFB, "/0u error: no action specified#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'b':
            // Read or write data bytes to the AFE board, via the I2C1 module.
            // The form of the command is
            // 'b' <action> <addr7bit> <nbytes> <byte0> <byte1> ...
            // <action> is one of 'w' or 'r'
            // <addr7bit> is the 7-bit address of the I2C slave device
            // <nbytes> is the number of bytes to read or write
            // <byte0> <byte1> ... are the bytes to write
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume is is a single character
                // that specifies the action, as described above.
                char action = (char) *token_ptr;
                if (action == 'R' || action == 'r') {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        uint8_t addr7bit = (uint8_t) atoi(token_ptr);
                        token_ptr = strtok(NULL, sep_tok);
                        if (token_ptr) {
                            uint8_t nbytes = (uint8_t) atoi(token_ptr);
                            if (nbytes > NBUF_I2C) nbytes = NBUF_I2C;
                            for (uint8_t j=0; j < NBUF_I2C; ++j) { buf_I2C[j] = 0; }
                            nbytes = i2c1_read(addr7bit, nbytes, buf_I2C, 30);
                            if (nbytes > 0) {
                                // Successfully read some bytes, so assemble response.
                                nchar = snprintf(bufB, NBUFB, "/0b r %d %d", addr7bit, nbytes);
                                for (uint8_t j=0; j < nbytes; ++j) {
                                    nchar = snprintf(buf_digits, NBUF_DIGITS, " %d", buf_I2C[j]);
                                    strncat(bufB, buf_digits, NBUF_DIGITS);
                                }
                                nchar = snprintf(buf_digits, NBUF_DIGITS, "#\n");
                                strncat(bufB, buf_digits, NBUF_DIGITS);
                            } else {
                                nchar = snprintf(bufB, NBUFB,
                                                 "/0b r %d %d error: no bytes read#\n",
                                                 addr7bit, nbytes);                                
                            }
                        } else {
                            nchar = snprintf(bufB, NBUFB,
                                             "/0b r %d error: nbytes not specified#\n",
                                             addr7bit);
                        }
                    } else {
                        nchar = snprintf(bufB, NBUFB, "/0b r error: address not specified#\n");
                    }
                } else if (action == 'W' || action == 'w') {
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        uint8_t addr7bit = (uint8_t) atoi(token_ptr);
                        token_ptr = strtok(NULL, sep_tok);
                        if (token_ptr) {
                            uint8_t nbytes = (uint8_t) atoi(token_ptr);
                            if (nbytes > 0) {
                                if (nbytes > NBUF_I2C) nbytes = NBUF_I2C;
                                for (uint8_t j=0; j < NBUF_I2C; ++j) { buf_I2C[j] = 0; }
                                // Get the data bytes from the RS485 message.
                                for (uint8_t j=0; j < nbytes; ++j) {
                                    token_ptr = strtok(NULL, sep_tok);
                                    if (token_ptr) {
                                        buf_I2C[j] = (uint8_t) atoi(token_ptr);
                                    } else {
                                        break;
                                    }
                                }
                                // Attempt to write those bytes to the I2C slave.
                                uint8_t nbytes_written = i2c1_write(addr7bit, nbytes, buf_I2C, 30);
                                if (nbytes_written == nbytes) {
                                    // Assemble RS485 response from the bytes successfully written.
                                    nchar = snprintf(bufB, NBUFB, "/0b w %d %d", addr7bit, nbytes);
                                    for (uint8_t j=0; j < nbytes; ++j) {
                                        nchar = snprintf(buf_digits, NBUF_DIGITS, " %d", buf_I2C[j]);
                                        strncat(bufB, buf_digits, NBUF_DIGITS);
                                    }
                                    nchar = snprintf(buf_digits, NBUF_DIGITS, "#\n");
                                    strncat(bufB, buf_digits, NBUF_DIGITS);
                                } else {
                                    nchar = snprintf(bufB, NBUFB,
                                                     "/0b w %d %d error: not all bytes written#\n",
                                                     addr7bit, nbytes_written);
                                }
                            } else {
                                nchar = snprintf(bufB, NBUFB,
                                                 "/0b w %d %d error: no bytes to write#\n",
                                                 addr7bit, nbytes);                                
                            }
                        } else {
                            nchar = snprintf(bufB, NBUFB,
                                             "/0b w %d error: nbytes not specified#\n",
                                             addr7bit);
                        }
                    } else {
                        nchar = snprintf(bufB, NBUFB, "/0b w error: address not specified#\n");
                    }
                } else {
                    nchar = snprintf(bufB, NBUFB, "/0b error: action is not read nor write#\n");
                }
            } else {
                nchar = snprintf(bufB, NBUFB, "/0b error: no read/write action specified#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'c':
            // Read or write data bytes to the AFE board, via SPI.
            // The form of the command is one of:
            // 'c' 'i' <upin> <ckp> <cke> <smp>
            // 'c' 'e' <nbytes> <byte0> <byte1> ...
            // 'c' 'c'
            // where
            // <upin> specifies which utility pin 0,1,2,3 to use for slave-select
            // <ckp> is clock polarity (1=idle state is high level)
            // <cke> is clock edge for data output (0=output on idle to active)
            // <smp> is the input sampling point (0=mid of data output time)
            // <nbytes> is the number of bytes to read or write
            // <byte0> <byte1> ... are the bytes to write
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume is is a single character
                // that specifies the action, as described above.
                char action = (char) *token_ptr;
                if (action == 'I' || action == 'i') {
                    // Initialize the SPI module with a specific mode details
                    // and selecting a specific slave device via a GPIO pin.
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        uint8_t upin = (uint8_t) (atoi(token_ptr) & 0b11);
                        token_ptr = strtok(NULL, sep_tok);
                        if (token_ptr) {
                            uint8_t ckp = (uint8_t) (atoi(token_ptr) & 1);
                            if (token_ptr) {
                                uint8_t cke = (uint8_t) (atoi(token_ptr) & 1);
                                token_ptr = strtok(NULL, sep_tok);
                                if (token_ptr) {
                                    uint8_t smp = (uint8_t) (atoi(token_ptr) & 1);
                                    spi1_init(upin, ckp, cke, smp);
                                    nchar = snprintf(bufB, NBUFB, "/0c i %d %d %d %d#\n",
                                                     upin, ckp, cke, smp);
                                } else {
                                    nchar = snprintf(bufB, NBUFB,
                                                     "/0c i %d %d %d error: smp not specified#\n",
                                                     upin, ckp, cke);
                                }
                            } else {
                                nchar = snprintf(bufB, NBUFB,
                                                 "/0c i %d %d error: cke smp not specified#\n",
                                                 upin, ckp);
                            }
                        } else {
                            nchar = snprintf(bufB, NBUFB,
                                             "/0c i %d error: ckp cke smp not specified#\n",
                                             upin);
                        }
                    } else {
                        nchar = snprintf(bufB, NBUFB,
                                         "/0c i error: upin ckp cke smp not specified#\n");
                    }
                } else if (action == 'E' || action == 'e') {
                    // Exchange a number of bytes with the selected device.
                    token_ptr = strtok(NULL, sep_tok);
                    if (token_ptr) {
                        uint8_t nbytes = (uint8_t) atoi(token_ptr);
                        if (nbytes > 0) {
                            if (nbytes > NBUF_I2C) nbytes = NBUF_I2C;
                            for (uint8_t j=0; j < NBUF_I2C; ++j) { buf_I2C[j] = 0; }
                            // Get the data bytes from the RS485 message.
                            for (uint8_t j=0; j < nbytes; ++j) {
                                token_ptr = strtok(NULL, sep_tok);
                                if (token_ptr) {
                                    buf_I2C[j] = (uint8_t) atoi(token_ptr);
                                } else {
                                    break;
                                }
                            }
                            // Attempt to write those bytes to the SPI slave.
                            uint8_t nbytes_written = spi1_exchange(nbytes, buf_I2C);
                            if (nbytes_written == nbytes) {
                                // Assemble RS485 response from the bytes successfully written.
                                nchar = snprintf(bufB, NBUFB, "/0c e %d", nbytes);
                                for (uint8_t j=0; j < nbytes; ++j) {
                                    nchar = snprintf(buf_digits, NBUF_DIGITS, " %d", buf_I2C[j]);
                                    strncat(bufB, buf_digits, NBUF_DIGITS);
                                }
                                nchar = snprintf(buf_digits, NBUF_DIGITS, "#\n");
                                strncat(bufB, buf_digits, NBUF_DIGITS);
                            } else {
                                nchar = snprintf(bufB, NBUFB,
                                                 "/0c e %d error: not all bytes exchanged#\n",
                                                 nbytes_written);
                            }
                        } else {
                            nchar = snprintf(bufB, NBUFB,
                                             "/0c e %d error: no bytes to exchange#\n",
                                             nbytes);                                
                        }
                    } else {
                        nchar = snprintf(bufB, NBUFB,
                                         "/0c e error: nbytes not specified#\n");
                    }
                } else if (action == 'C' || action == 'c') {
                    // Close the SPI module.
                    spi1_close();
                } else {
                    nchar = snprintf(bufB, NBUFB,
                                     "/0c error: action is not init, exchange or close#\n");
                }
            } else {
                nchar = snprintf(bufB, NBUFB,
                                 "/0c error: no init/exchange/close action specified#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'w':
            // Enable V_REF_A output to feed MCP3301 chips 0-3 and
            // enable V_REF_B output to feed MCP3301 chips 4-7.
            token_ptr = strtok(&cmdStr[1], sep_tok);
            if (token_ptr) {
                // Found some non-blank text; assume levelA followed by levelB.
                // levelB is optional and, if omitted, get set the same as levelA.
                int16_t levelA = atoi(token_ptr);
                int16_t levelB = levelA;
                token_ptr = strtok(NULL, sep_tok);
                if (token_ptr) {
                    levelB = atoi(token_ptr);
                }
                if (levelA > 255) levelA = 255;
                if (levelA < 0) levelA = 0;
                if (levelB > 255) levelB = 255;
                if (levelB < 0) levelB = 0;
                set_VREF_AB((uint8_t)levelA, (uint8_t)levelB);
                nchar = snprintf(bufB, NBUFB, "/0w V_REF_A=%d V_REF_B=%d#\n", levelA, levelB);
            } else {
                // There was no text to indicate action.
                nchar = snprintf(bufB, NBUFB, "/0w error: missing levelA and levelB#\n");
            }
            uart1_putstr(bufB);
            break;
        case 'X':
            // Pass through a command to the Pico2 DAQ MCU.
            if (PICO2_READY_PIN) {
                // DAQ MCU is ready and waiting for a command.
                // nchar = snprintf(bufB, NBUFB, "DEBUG About to send command:%s\n", &cmdStr[1]); uart1_putstr(bufB);
                uart2_putstr(&cmdStr[1]);
                uart2_putch('\n');
                // The DAQ MCU may start its response within 200us,
                // so start listening for that response immediately.
                uart2_getstr(bufC, NBUFC);
                nchar = snprintf(bufB, NBUFB, "/0X %s#\n", &bufC[0]);
            } else {
                // DAQ MCU is not ready for a command.
                nchar = snprintf(bufB, NBUFB, "/0X error: DAQ MCU busy#\n");
            }
            uart1_putstr(bufB);
            break;
        default:
            nchar = snprintf(bufB, NBUFB, "/0%c error: Unknown command#\n", cmdStr[0]);
            uart1_putstr(bufB);
    }
} // end interpret_RS485_command()

int main(void)
{
    int m;
    int n;
    init_pins();
    uart1_init(115200); // RS485 comms
    uart2_init(230400); // comms to Pico2 DAQ-MCU
    uart2_flush_rx(); // Discard any characters already arrived from Pico2 MCU
    FVR_init();
    ADC_init();
    set_VREF_AB(255, 255); // Full 4v096 reference, by default.
    i2c1_init();
    // Wait until we are reasonably sure that the Pico2 has restarted
    // and then flush the incoming serial buffer.
    __delay_ms(100);
    uart2_flush_rx();
    // We will operate this COMMS_MCU as a slave,
    // waiting for commands and only responding when spoken to.
    while (1) {
        // Characters are not echoed as they are typed.
        // Backspace deleting is allowed.
        // NL (Ctrl-J) signals end of incoming string.
        m = uart1_getstr(bufA, NBUFA);
        if (m > 0) {
            char* cmd = trim_RS485_command(bufA, NBUFA);
            // Note that the cmd string may be of zero length,
            // with the null character in the first place.
            // If that is the case, do nothing with it.
            if (*cmd) {
                interpret_RS485_command(cmd);
            }
        }
    }
    disable_hardware_trigger();
    release_event_pin();
    i2c1_close();
    disable_VREF_AB();
    ADC_close();
    FVR_close();
    uart2_flush_rx();
    uart2_close();
    uart1_flush_rx();
    uart1_close();
    return 0; // Expect that the MCU will reset.
} // end main
